In [1]:
import duckdb

In [4]:
con = duckdb.connect(database='dados_duckdb.db' , read_only=False)

In [5]:
df = con.execute("SELECT * FROM produtos").fetchdf()
df.head(10)

      id nm_produto id_categoria  id_fornecedor  vl_preco
0  10003      PREGO         BT10            100      60.0
1  10005    MACHADO         BT56            100     100.0
2  10001   PARAFUSO         BT10            100     100.0
3  10002    MARTELO         BT56            100    1500.0
4  10004      SERRA         BT56            100     200.0

In [6]:
df2 = df.drop(columns=['id_categoria', 'id_fornecedor'])  # remove as colunas 'id_categoria' e 'id_fornecedor' do DataFrame
df2.head(10)                                              # exibe as 10 primeiras linhas do novo DataFrame df2

      id nm_produto  vl_preco
0  10003      PREGO      60.0
1  10005    MACHADO     100.0
2  10001   PARAFUSO     100.0
3  10002    MARTELO    1500.0
4  10004      SERRA     200.0

In [11]:
con.execute("""
CREATE TABLE IF NOT EXISTS dim_produtos (   -- cria a tabela 'dim_produtos' se ela não existir
    id_produto BIGINT,                      -- coluna para o código do produto (número inteiro grande)
    nm_produto TEXT,                         -- coluna para o nome do produto (texto)
    vl_produto FLOAT                         -- coluna para o valor/preço do produto (número decimal)
)
""")

In [12]:
df_dim = con.execute("SELECT * FROM dim_produtos").fetchdf()  # consulta todos os registros da tabela 'dim_produtos' e carrega no DataFrame
df_dim.head(10)                                               # exibe as 10 primeiras linhas do DataFrame

Empty DataFrame
Columns: [id_produto, nm_produto, vl_produto]
Index: []

In [13]:
df2.head(10)

      id nm_produto  vl_preco
0  10003      PREGO      60.0
1  10005    MACHADO     100.0
2  10001   PARAFUSO     100.0
3  10002    MARTELO    1500.0
4  10004      SERRA     200.0

In [14]:
#Pega todos os registros do DataFrame temporário df2 (que está registrado como tabela temporária no DuckDB)

#Insere diretamente na tabela dim_produtos do banco.

con.execute("INSERT INTO dim_produtos SELECT * FROM df2")
df_dim.head(10)

Empty DataFrame
Columns: [id_produto, nm_produto, vl_produto]
Index: []

In [15]:
df_dim = con.execute("SELECT * FROM dim_produtos").fetchdf()
df_dim.head(10)

   id_produto nm_produto  vl_produto
0       10003      PREGO        60.0
1       10005    MACHADO       100.0
2       10001   PARAFUSO       100.0
3       10002    MARTELO      1500.0
4       10004      SERRA       200.0

In [16]:
con.close()